Revit 2027 API
WallType.Kind Property
 The nature of the wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WallKind Kind { get; }
Public ReadOnly Property Kind As WallKind
	Get
public:
property WallKind Kind {
	WallKind get ();
}
member Kind : WallKind with get
Property Value
WallKind
See Also
Reference
WallType Class
Autodesk.Revit.DB Namespace